/******************************************************/
/* lab_work_01_02. */
/* Ввести, відлагодити та протестувати програму */
/* засобами мови С, у якій передбачити виведення на */
/* екран даних цілого, дійсного та символьного типів */
/* з використанням відповідних форматів. */
/******************************************************/
#include <stdio.h>
#include <conio.h>
int main()
{
    char symv = 'A';
    // Форматований вивiд даних цiлих типiв
    printf(" Друк десяткового числа 455 форматом %%d :\n");
    printf(" %d\n",455);
    printf(" Друк десяткового числа 455 форматом %%i :\n");
    printf(" %i\n",455);
    printf(" Друк десяткового числа +455 форматом %%d :\n");
    printf(" %d\n",+455);
    printf(" Друк десяткового числа -455 форматом %%d :\n");
    printf(" %d\n",-455);
    printf(" Друк десяткового числа 32000 форматом %%hd :\n");
    printf(" %hd\n",32000);
    printf(" Друк числа 2000000000 форматом %%ld :\n");
    printf(" %ld\n",2000000000);
    printf(" Друк вiсiмкового числа 455 форматом %%o :\n");
    printf(" %o\n",455);
    printf(" Друк числа -455 форматом %%u :\n");
    printf(" %u\n",-455);
    printf(" Друк шiстнадцяткового числа 455 форматом %%x :\n");
    printf(" %x\n",455);
    printf(" Друк шiстнадцяткового числа 455 форматом %%X :\n");
    printf(" %X\n\n",455);
    // Форматований вивiд даних дійсних типiв
    printf(" Друк дiйсного числа 1234567.89 форматом %%e :\n");
    printf(" %e\n",1234567.89);
    printf(" Друк дiйсного числа +1234567.89 форматом %%e :\n");
    printf(" %e\n",+1234567.89);
    printf(" Друк дiйсного числа -1234567.89 форматом %%e :\n");
    printf(" %e\n",-1234567.89);
    printf(" Друк дiйсного числа -1234567.89 форматом %%e :\n");
    printf(" %e\n",-1234567.89);
    printf(" Друк дiйсного числа 1234567.89 форматом %%E :\n");
    printf(" %E\n",1234567.89);
    printf(" Друк дiйсного числа 1234567.89 форматом %%f :\n");
    printf(" %f\n",1234567.89);
    printf(" Друк дiйсного числа 1234567.89 форматом %%g :\n");
    printf(" %g\n",1234567.89);
    printf(" Друк дiйсного числа 1234567.89 форматом %%G :\n"); printf("%G\n\n",1234567.89);
    // Форматований вивiд даних символьного типу char
    char str[] = "Це стрiчка";
    const char *strPtr="Це також стрiчка";
    printf("\n Друк символа 'A' за форматом %%c:");
    printf("\n %c",symv);
    printf("\n Друк стрiчки-константи за форматом %%s:");
    printf("\n %s","Це стрiчка");
    printf("\n Друк стрiчки з iм'ям str за форматом %%s:");
    printf("\n %s",str);
    printf("\n Друк стрiчки з допомогою вказiвника strPtr за форматом%%s:");
    printf("\n %s",strPtr);
    getch();
    return 0;
}