/*********************************************************/
/* lab_work_01_03 */
/* Виведення даних різних типів з використанням */
/* форматів d,f,e,E,g,G,p та прапорців '-' '+' ' ' '#' '0' */
/* для форматованого виводу даних засобами мови С. */
/*********************************************************/
#include <stdio.h>
#include <conio.h>
int main()
{
    // Друк додатнiх цiлих чисел
    // з одночасним вирiвнюванням по правому краю:
    printf("\n%s\n%s\n",
    " Друк додатнiх цiлих чисел за форматом %4d",
    " з одночасним вирiвнюванням по правому краю:");
    printf(" %4d\n",1);
    printf(" %4d\n",12);
    printf(" %4d\n",123);
    printf(" %4d\n",1234);
    printf(" %4d\n",12345);
    printf("%s\n%s\n",
    " В останньому випадку бракувало ширини формату-",
    " цим пояснюється неякiсне вирiвнювання");
    printf("\n%s\n%s\n",
    " Друк вiд'ємних цiлих чисел за форматом %4d",
    " з одночасним вирiвнюванням по правому краю:");
    printf(" %4d\n",-1);
    printf(" %4d\n",-12);
    printf(" %4d\n",-123);
    printf(" %4d\n",-1234);
    printf(" %4d\n",-12345);
    printf("%s\n%s\n",
    " В останнiх двох випадках бракувало ширини формату -",
    " цим пояснюється неякiсне вирiвнювання");
    getch();
    // Використання у форматах прапорця (-)
    // для вирiвнювання по лiвому краю:
    printf("\n%s\n%s\n",
    " Друк констант рiзного типу за форматами з восьмисимволiв"," з одночасним вирiвнюванням по правому краю:"); printf("%8s%8d%8c%8f\n", "Привiт",7,'a',1.23); printf("\n%s\n%s\n",
    " Використання у форматах прапорця (-) ",
    " для вирiвнювання по лiвому краю:");
    printf(" %-8s%-8d%-8c%-8f\n", "Привiт",7,'a',1.23); getch();
    // Використання у форматах прапорця (+)
    // для обов'язкового друку знака чисел:
    printf("\n%s\n%s\n"," Друк констант цiлого типу за форматом %d "," з одночасним вирiвнюванням по правому краю:"); printf("%d\n %d\n",786,-786); printf("\n%s\n%s\n"," Використання у форматах прапорця (+) "," для обов'язкового друку знака чисел:"); printf("%+d\n %+d\n",786,-786);
    getch();
    // Використання у форматах прапорця (пробiл)
    // для друку знака пробiл перед додатнiми числами:
    printf("\n%s\n%s\n"," Друк констант цiлого типу за форматом %d "," з одночасним вирiвнюванням по правому краю:"); printf("%d\n %d\n",786,-786); printf("\n%s\n%s\n"," Використання у форматах прапорця (пробiл) "," для друку знака пробiл перед додатнiми числами:"); printf("%d\n %d\n",786,-786);
    getch();
    // Використання у форматах прапорця (#) для друку:
    // знака о - перед вiсiмковими числами
    // знака x - перед шiстнадцятковими числами
    // крапки - в дiйсних числах
    int c=1427;
    double p=1427.0;
    printf("\n%s\n%s\n%s\n%s\n%s\n%s\n",
    " Використання у форматах прапорця (#) ",
    " для друку:",
    " знака о - перед вiсiмковими числами",
    " знака x - перед шiстнадцятковими числами",
    " знака X - перед шiстнадцятковими числами",
    " крапки - в дiйсних числах");
    printf("\n %#o",c);
    printf("\n %#x",c);
    printf("\n %#X",c);
    printf("\n %g",p);
    printf("\n %#g\n",p);
    getch();
    // Використання у форматах прапорця (0)
    // для заповнення порожнiх символiв формату нулями:
    printf("\n%s\n%s\n",
    " Використання у форматах прапорця (0) ",
    " для заповнення порожнiх символiв формату нулями:"); printf("%+09d\n",452);
    printf(" %09d\n",452); getch();
    return 0;
}
